Функция РезультатФункции(ИмяМодуля, ИмяФункции, П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null, П10 = Null) Экспорт
	Переопределена = Переопределена(ИмяМодуля, ИмяФункции);
	Если НЕ Переопределена Тогда
		Возврат А1Э_Общее.РезультатФункции(ИмяМодуля + "." + ИмяФункции + "__Исходно", П1, П2, П3, П4, П5, П6, П7, П8, П9, П10);
	Иначе
		Возврат А1Э_Общее.РезультатФункции(ИмяМодуля + "__Переопределение." + ИмяФункции, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10);
	КонецЕсли;
		
КонецФункции 

Функция Переопределена(ИмяМодуля, ИмяФункции, ПовторноеИспользование = Истина) Экспорт
	Если ПовторноеИспользование = Истина Тогда
		Возврат А1Э_ПовторноеИспользование.РезультатФункции("А1Э_Переопределение.Переопределена", ИмяМодуля, ИмяФункции, Ложь);
	КонецЕсли;
	ИмяМодуляПереопределения = ИмяМодуля + "__Переопределение";
	МодульПереопределения = А1Э_Метаданные.ДанныеОбщегоМодуля(ИмяМодуляПереопределения);
	Если МодульПереопределения = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Попытка
			ПереопределенныеФункции = Вычислить(ИмяМодуляПереопределения + ".ПереопределенныеФункции()");	
		Исключение
			А1Э_Служебный.СлужебноеИсключение("Не удалось вызвать Функцию <ПереопределенныеФункции> из модуля <" + ИмяМодуля +">!" + Символы.ПС + 
			"Проверьте что функция существует и является экспортной!");
		КонецПопытки;
		Попытка
			ДанныеВызова = ПереопределенныеФункции[ИмяФункции];
		Исключение
			А1Э_Служебный.СлужебноеИсключение("Функция <ПереопределенныеФункции> в модуле <" + ИмяМодуля + "> должна возвращать Соответствие!");
		КонецПопытки;
	КонецЕсли;
	Возврат ДанныеВызова <> Неопределено;
КонецФункции
