#Область ПрограммныйИнтерфейс

Функция ФормаИзменитьСтрокуТЧ(Форма, ИмяТЧ, Знач СтрокаТЧ, ИмяРеквизита, НовоеЗначение) Экспорт 
	Возврат ИзменитьСтрокуТЧ(Форма, ИмяТЧ, СтрокаТЧ, ИмяРеквизита, НовоеЗначение, Форма.А1Э_ИзменениеОбъектов__Кэш);
КонецФункции

Функция ИзменитьСтрокуТЧ(ФормаИлиОбъект, ИмяТЧ, Знач СтрокаТЧ, ИмяРеквизита, НовоеЗначение, Кэш = Неопределено) Экспорт
	Если ТипЗнч(ФормаИлиОбъект) = А1Э_СтандартныеТипы.ФормаКлиентскогоПриложения() Тогда
		Форма = ФормаИлиОбъект;
		Объект = Форма.Объект;
	Иначе
		Форма = Неопределено;
		Объект = ФормаИлиОбъект;		
	КонецЕсли;
	#Если НЕ Клиент Тогда
		АктуализироватьКэшПриНеобходимости(ФормаИлиОбъект, Кэш);
	#Иначе
		Если Кэш = Неопределено Тогда
			А1Э_Служебный.СлужебноеИсключение("Актуализация кэша изменения объекта на клиенте невозможна!");
		КонецЕсли;
	#КонецЕсли
	 	 
	Если ТипЗнч(СтрокаТЧ) = Тип("Число") Тогда
		СтрокаТЧ = Объект[ИмяТЧ][СтрокаТЧ];
	КонецЕсли;
	
	Снимок = Неопределено;
	#Если НЕ Клиент Тогда
		Если ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура") Тогда //Используем кэширование через структуру с метаданными
			Снимок = Новый Структура;
			МетаданныеТЧ = Объект.Метаданные().ТабличныеЧасти[ИмяТЧ];
			Для Каждого Реквизит Из МетаданныеТЧ.Реквизиты Цикл
				Снимок.Вставить(Реквизит.Имя, СтрокаТЧ[Реквизит.Имя]);
			КонецЦикла;
		КонецЕсли;
	#КонецЕсли
	
	Если Снимок = Неопределено Тогда 
		Снимок = Объект[ИмяТЧ].Добавить(); //Проще всего исходную строку хранить в новой строке таблицы.
		ЗаполнитьЗначенияСвойств(Снимок, СтрокаТЧ);
		Объект[ИмяТЧ].Удалить(Снимок); //Сразу удаляем строку - она исчезает из таблицы, но продолжает хранить данные.
	КонецЕсли;
	
	Попытка
		ИзменитьСтрокуТЧБезОбвязки(Объект, ИмяТЧ, СтрокаТЧ, ИмяРеквизита, НовоеЗначение, Кэш); 
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		УстановитьПрерываниеВыполнения(Кэш);
	КонецПопытки;
	
	Если Кэш.ПрерываниеВыполнения = Истина Тогда //Изменение завершилось неудачно, откатываем.
		ПрерываниеВыполнения = Истина;
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Снимок);
	КонецЕсли;
	Кэш.ПрерываниеВыполнения = Неопределено;
	
	Если ОписаниеОшибки <> Неопределено Тогда
		А1Э_Служебный.СлужебноеИсключение("Ошибка при изменении реквизита - " + ОписаниеОшибки);
	КонецЕсли;
	
	Возврат ПрерываниеВыполнения;
КонецФункции 

Функция ИзменитьСтрокуТЧБезОбвязки(Объект, ИмяТЧ, СтрокаТЧ, ИмяРеквизита, НовоеЗначение, Кэш) Экспорт
	СтароеЗначение = СтрокаТЧ[ИмяРеквизита];
	СтрокаТЧ[ИмяРеквизита] = НовоеЗначение;
	
	Для Сч = 0 По Кэш.ФункцииОбработчика.Количество() - 1 Цикл
		ФункцияОбработчика = Кэш.ФункцииОбработчика[Сч];
		А1Э_Общее.РезультатФункции(ФункцияОбработчика.ИмяФункции, Объект, ИмяТЧ, СтрокаТЧ, ИмяРеквизита, СтароеЗначение, Кэш);
		Если Кэш.ПрерываниеВыполнения = Истина Тогда Возврат Неопределено; КонецЕсли;
	КонецЦикла;

КонецФункции 

Функция ПрикладнойКэш(Форма) Экспорт
	Возврат Форма.А1Э_ИзменениеОбъектов__Кэш.ПрикладнойКэш;
КонецФункции

Функция УстановитьПрерываниеВыполнения(Кэш) Экспорт
	Кэш.ПрерываниеВыполнения = Истина; 
КонецФункции

#КонецОбласти 

#Область Механизм

Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииНаСервере", Истина);
	
	Настройки.ПорядокВыполнения = 10000;
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
		Если А1Э_Формы.ТипФормы(Форма) <> "ФормаЭлемента" Тогда Возврат Неопределено; КонецЕсли;
		Если НЕ А1Э_УниверсальнаяФорма.Инициализирована(Форма) Тогда Возврат Неопределено; КонецЕсли;
		МетаданныеОбъекта = Форма.Объект.Ссылка.Метаданные();
		МеханизмПрименен = Ложь;
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			ТаблицаФормы = Форма.Элементы.Найти(ТабличнаяЧасть.Имя); 
			Если ТаблицаФормы = Неопределено Тогда Продолжить; КонецЕсли;
			Если ТипЗнч(ТаблицаФормы) <> Тип("ТаблицаФормы") Тогда Продолжить; КонецЕсли;
			МеханизмПрименен = Истина;
			Для Каждого Элемент Из ТаблицаФормы.ПодчиненныеЭлементы Цикл
				Если Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда Продолжить; КонецЕсли;
				А1Э_УниверсальнаяФорма.ДобавитьОбработчикЭлементаФормы(Форма, Элемент, "ОкончаниеВводаТекста", "А1Э_ИзменениеОбъектов.ЯчейкаОкончаниеВводаТекста");
				А1Э_УниверсальнаяФорма.ДобавитьОбработчикЭлементаФормы(Форма, Элемент, "ОбработкаВыбора", "А1Э_ИзменениеОбъектов.ЯчейкаОбработкаВыбора");
				А1Э_УниверсальнаяФорма.ДобавитьОбработчикЭлементаФормы(Форма, Элемент, "ПриИзменении", "А1Э_ИзменениеОбъектов.ЯчейкаПриИзменении");
			КонецЦикла;
		КонецЦикла;
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, "А1Э_ИзменениеОбъектов__ЗначениеЯчейки", "");
		А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, "А1Э_ИзменениеОбъектов__Кэш", "", , ,
		А1Э_Структуры.Создать(
		"ЗначениеРеквизита", Кэш(Форма)
		));
		А1Э_Формы.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
	КонецФункции
	
#КонецЕсли
#Если Клиент Тогда
	
	Функция ЯчейкаПриИзменении(Форма, Элемент) Экспорт
		Таблица = А1Э_Формы.ТаблицаЭлемента(Форма, Элемент);
		ИмяРеквизита =  ИмяРеквизита(Таблица, Элемент); 
		Прерывание = ИзменитьСтрокуТЧ(Форма, Таблица.Имя, Таблица.ТекущиеДанные, ИмяРеквизита, Таблица.ТекущиеДанные[ИмяРеквизита], Форма.А1Э_ИзменениеОбъектов__Кэш);
		Если Прерывание = Истина Тогда //Так как реквизит уже был изменен в начале обработчика, возвращаем его назад принудительно.
			Таблица.ТекущиеДанные[ИмяРеквизита] = Форма.А1Э_ИзменениеОбъектов__ЗначениеЯчейки;
		КонецЕсли;
		
	КонецФункции 
	
	Функция ЯчейкаОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
		УстановитьТекущееЗначениеЯчейки(Форма, Элемент);
	КонецФункции
	
	Функция ЯчейкаОкончаниеВводаТекста(Форма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) Экспорт 
		УстановитьТекущееЗначениеЯчейки(Форма, Элемент);
	КонецФункции
	
	Функция УстановитьТекущееЗначениеЯчейки(Форма, Элемент)
		Таблица = А1Э_Формы.ТаблицаЭлемента(Форма, Элемент);
		Форма.А1Э_ИзменениеОбъектов__ЗначениеЯчейки = Таблица.ТекущиеДанные[ИмяРеквизита(Таблица, Элемент)];
	КонецФункции 
	
	Функция ИмяРеквизита(Таблица, Элемент) 
		Возврат А1Э_Строки.После(Элемент.Имя, Таблица.Имя);
	КонецФункции 
#КонецЕсли

#Если НЕ Клиент Тогда
	
	Функция АктуализироватьКэшПриНеобходимости(ФормаИлиОбъект, Кэш) 
		Если Кэш <> Неопределено Тогда Возврат Неопределено; КонецЕсли;
		
		Кэш = Кэш(ФормаИлиОбъект); 
	КонецФункции
	
	Функция Кэш(ФормаИлиОбъект)  
		ИмяМетаданных = А1Э_Механизмы.ИмяМетаданныхОбъекта(ФормаИлиОбъект);
		ФункцииОбработчика = А1Э_Механизмы.ФункцииОбработчикаОбъекта("А1Э_ПриИзмененииСтрокиТЧ", ИмяМетаданных);
		ПрикладнойКэш = Новый Структура;
		А1Э_Механизмы.ВыполнитьМеханизмыОбработчикаОбъекта("ПриПолученииКэшаОбъекта", ФормаИлиОбъект, ПрикладнойКэш);
		
		Возврат А1Э_Структуры.Создать(
		"Класс", "А1Э_ИзменениеОбъектов_Кэш",
		"ИмяМетаданных", ИмяМетаданных,
		"ФункцииОбработчика", ФункцииОбработчика,
		"ПрикладнойКэш", ПрикладнойКэш,
		"ПрерываниеВыполнения", Неопределено,
		); 
	КонецФункции 
	
#КонецЕсли

#КонецОбласти 
