Функция Модуль(Число) Экспорт
	Если Число < 0 Тогда
		Возврат - Число;
	Иначе
		Возврат ЧИсло;
	КонецЕсли;
КонецФункции

Функция ОписаниеТипа(Длина, ДлинаДробнойЧасти = 0) Экспорт
	Возврат Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(Длина, ДлинаДробнойЧасти));	
КонецФункции

Функция ВЧисло(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	ИначеЕсли Значение = Неопределено Тогда
		Возврат 0;
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Значение", "А1Э_Числа.ВЧисло", Значение, "Число,Неопределено");
	КонецЕсли;
КонецФункции

Функция УменьшениеОстатка(Остаток, Уменьшение) Экспорт
	Если Остаток <= 0 Тогда
		Возврат 0;
	ИначеЕсли Остаток > Уменьшение Тогда
		Остаток = Остаток - Уменьшение;
		Возврат Уменьшение;
	Иначе
		РеальноеУменьшение = Остаток;
		Остаток = 0;
		Возврат РеальноеУменьшение;
	КонецЕсли;
КонецФункции 