Функция ПроверитьРаботоспособностьСистемы() Экспорт
	А1Э_ДопРеквизиты.ПроверитьСуществованиеСлужебныхДопРеквизитов();	
КонецФункции

Функция ИмяСистемногоПользователя() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции

//Экспорт - Используется для принудительного серверного вызова
Функция РезультатФункции(ПолноеИмяФункции, Параметр1 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр2 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр3 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр4 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр5 = "НЕ_БУДЕТ_ДОБАВЛЕНО",
	Параметр6 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр7 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр8 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр9 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр10 = "НЕ_БУДЕТ_ДОБАВЛЕНО") Экспорт 
	
	Возврат А1Э_Общее.РезультатФункции(ПолноеИмяФункции, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5,
	Параметр6, Параметр7, Параметр8, Параметр9, Параметр10)
КонецФункции

//Экспорт - Используется для принудительного серверного вызова
Процедура РезультатПроцедуры(ПолноеИмяФункции, Параметр1 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр2 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр3 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр4 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр5 = "НЕ_БУДЕТ_ДОБАВЛЕНО",
	Параметр6 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр7 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр8 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр9 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Параметр10 = "НЕ_БУДЕТ_ДОБАВЛЕНО") Экспорт
	
	А1Э_Общее.РезультатПроцедуры(ПолноеИмяФункции, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5,
	Параметр6, Параметр7, Параметр8, Параметр9, Параметр10)
КонецПроцедуры

#Область Устарело

//Устарело - использовать РезультатПроцедуры() 
// Осуществляет вызов процедуры или функции на сервере. Используется для того чтобы гарантировать выполнение на сервере в клиент-серверных модулях
// Не возвращает значений.
// Параметры:
//  ПолноеИмяФункции - Строка - в формате "ИмяОбщегоМодуля.ИмяФункции" или "Справочники.ИмяСправочника.ИмяФункции".
//  Параметры		 - Массив - массив параметров, в порядке соответствующем порядку параметров вызываемой функции
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьПроцедуру(ПолноеИмяФункции, Параметры) Экспорт
	Возврат А1Э_Общее.ВыполнитьПроцедуру(ПолноеИмяФункции, Параметры);
КонецФункции

//Устарело - использовать РезультатФункции()
// Осуществляет вызов функции на сервере. Используется для того чтобы гарантировать выполнение на сервере в клиент-серверных модулях
// Возвращает значение в соответствии со значением возвращаемым процедурой
// Параметры:
//  ПолноеИмяФункции - Строка - в формате "ИмяОбщегоМодуля.ИмяФункции" или "Справочники.ИмяСправочника.ИмяФункции".
//  Параметры		 - Массив - массив параметров, в порядке соответствующем порядку параметров вызываемой функции
// 
// Возвращаемое значение:
//   - 
//
Функция ВычислитьФункцию(ПолноеИмяФункции, Параметры) Экспорт
	Возврат А1Э_Общее.ВычислитьФункцию(ПолноеИмяФункции, Параметры);
КонецФункции 

#КонецОбласти 
