Функция ЗначениеСвойства(Структура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	#Если Сервер И НЕ Сервер Тогда
		Структура = Новый Структура;		
	#КонецЕсли 
	Перем ЗначениеСвойства;
	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	ЕстьСвойство = Структура.Свойство(ИмяСвойства, ЗначениеСвойства);
	Если ЕстьСвойство Тогда	
		Возврат ЗначениеСвойства;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
КонецФункции 

Функция Структура(Данные) Экспорт
	Если Данные = Неопределено Тогда
		Возврат Новый Структура;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
		Возврат Данные;
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Данные", "А1Э_Структуры.Структура", Данные, "Структура,Неопределено");
	КонецЕсли;
КонецФункции

// Функция - Скопировать свойства
//
// Параметры:
//  Приемник - Структура - 
//  Источник - Структура - 
//  Замещать - Булево - 
// 
// Возвращаемое значение:
//   - 
//
Функция СкопироватьСвойства(Приемник, Источник, Замещать = Ложь, КопироватьНезаполненные = Истина) Экспорт
	
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	#Если Сервер И НЕ Сервер Тогда
		Приемник = Новый Структура;
		Источник = Новый Структура;
	#КонецЕсли 
	А1Э_Общее.ПроверитьТип(Приемник, "Структура");
	А1Э_Общее.ПроверитьТип(Источник, "Структура");
	А1Э_Общее.ПроверитьТип(Замещать, "Булево");
	
	Для Каждого Пара Из Источник Цикл
		Если Приемник.Свойство(Пара.Ключ) И НЕ Замещать Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ А1Э_СтандартныеТипы.Заполнено(Пара.Значение) И НЕ КопироватьНезаполненные Тогда
			Продолжить;
		КонецЕсли;
		Приемник.Вставить(Пара.Ключ, Пара.Значение);
	КонецЦикла;
КонецФункции

Функция Создать(Имя1 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Значение1 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Имя2 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Значение2 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Имя3 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Значение3 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Имя4 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Значение4 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Имя5 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Значение5 = "НЕ_БУДЕТ_ДОБАВЛЕНО") Экспорт
	Структура = Новый Структура;
	Если Имя1 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Структура;
	КонецЕсли;
	Структура.Вставить(Имя1, Значение1);
	Если Имя2 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Структура;
	КонецЕсли;
	Структура.Вставить(Имя2, Значение2);
	Если Имя3 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Структура;
	КонецЕсли;
	Структура.Вставить(Имя3, Значение3);
	Если Имя4 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Структура;
	КонецЕсли;
	Структура.Вставить(Имя4, Значение4);
	Если Имя5 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Структура;
	КонецЕсли;
	Структура.Вставить(Имя5, Значение5);
	Возврат Структура;
КонецФункции

Функция Скопировать(Структура) Экспорт
	#Если Сервер И НЕ Сервер Тогда
		Структура = Новый Структура;		
	#КонецЕсли 
	НоваяСтруктура = Новый Структура;
	Для Каждого Пара Из Структура Цикл
		НоваяСтруктура.Вставить(Пара.Ключ, Пара.Значение);	
	КонецЦикла;
	Возврат НоваяСтруктура;
КонецФункции

Функция ДобавитьКлючи(Ключи) Экспорт
	
КонецФункции

Функция Класс(Структура) Экспорт
	Возврат А1Э_Классы.Класс(Структура);	
КонецФункции