Функция ЗначениеСвойства(Структура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	#Если Сервер И НЕ Сервер Тогда
		Структура = Новый Структура;		
	#КонецЕсли 
	Перем ЗначениеСвойства;
	Если НЕ ЯвляетсяСтруктурой(Структура) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	ЕстьСвойство = Структура.Свойство(ИмяСвойства, ЗначениеСвойства);
	Если ЕстьСвойство Тогда	
		Возврат ЗначениеСвойства;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
КонецФункции 

Функция Свойство(Структура, ИмяСвойства, Значение = Неопределено) Экспорт 
	ЗначениеСвойства = ЗначениеСвойства(Структура, ИмяСвойства, Null);
	Если ЗначениеСвойства <> Null Тогда
		Значение = ЗначениеСвойства;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция Структура(Данные) Экспорт
	Если Данные = Неопределено Тогда
		Возврат Новый Структура;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
		Возврат Данные;
	ИначеЕсли ТипЗнч(Данные) = Тип("ФиксированнаяСтруктура") Тогда
		Возврат Новый Структура(Данные);
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Данные", ИмяМодуля() + ".Структура", Данные, "Структура,ФиксированнаяСтруктура,Неопределено");
	КонецЕсли;
КонецФункции

Функция Соответствие(Данные) Экспорт 
	Если Данные = Неопределено Тогда
		Возврат Новый Соответствие;
	ИначеЕсли ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Возврат Данные;
	ИначеЕсли ТипЗнч(Данные) = Тип("ФиксированноеСоответствие") Тогда
		Возврат Новый Соответствие(Данные);
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Данные", ИмяМодуля() + ".Соответствие", Данные, "Соответствие,ФиксированноеСоответствие,Неопределено");
	КонецЕсли;
КонецФункции

// Копирует свойства из одной структуры в другую. Рассматривает Неопределено как структуру без свойств.
//
// Параметры:
//  Приемник - Структура - 
//  Источник - Структура,Неопределено - 
//  Замещать - Булево - 
//  КопироватьНезаполненные - Булево - 
// 
// Возвращаемое значение:
//   - 
//
Функция СкопироватьСвойства(Приемник, Источник, Замещать = Ложь, КопироватьНезаполненные = Истина) Экспорт
	
	Если Источник = Неопределено Тогда Возврат Приемник; КонецЕсли;
	
	Если ТипЗнч(Приемник) <> Тип("Структура") Тогда
		Приемник = Структура(Приемник); //Исправляет ошибку с немутируемыми структурами (ПараметрыЗапроса, ect).
	КонецЕсли;
	
	Для Каждого Пара Из Источник Цикл
		Если Приемник.Свойство(Пара.Ключ) И Замещать <> Истина Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ А1Э_СтандартныеТипы.Заполнено(Пара.Значение) И НЕ КопироватьНезаполненные Тогда
			Продолжить;
		КонецЕсли;
		Приемник.Вставить(Пара.Ключ, Пара.Значение);
	КонецЦикла;
	
	Возврат Приемник;
КонецФункции

// Создает структуру. Предназначена для написания конструктора, где каждое свойство и значение на новой строке, что улучшает читаемость кода.
//
// Параметры:
//  К<Х>	 - Строка - ключи структуры.
//  З<Х>	 - Произвольный	 - значения структуры. 
// 
// Возвращаемое значение:
//   - Структура
//
Функция Создать(К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Структура = Новый Структура;
	Возврат ДобавитьКлючиИЗначения(Структура, К1, З1, К2, З2, К3, З3, К4, З4, К5, З5, К6, З6, К7, З7, К8, З8, К9, З9, К10, З10, К11, З11, К12, З12, К13, З13, К14, З14, К15, З15); 
КонецФункции

// Создает фиксированную структуру. Предназначена для написания конструктора, где каждое свойство и значение на новой строке, что улучшает читаемость кода.
//
// Параметры:
//  К<Х>	 - Строка - ключи структуры.
//  З<Х>	 - Произвольный	 - значения структуры. 
// 
// Возвращаемое значение:
//   - ФиксированнаяСтруктура
//  
Функция СоздатьФиксированную(К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Возврат Новый ФиксированнаяСтруктура(Создать(К1, З1, К2, З2, К3, З3, К4, З4, К5, З5, К6, З6, К7, З7, К8, З8, К9, З9, К10, З10, К11, З11, К12, З12, К13, З13, К14, З14, К15, З15));
КонецФункции

Функция Зафиксировать(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Возврат Новый ФиксированнаяСтруктура(Значение);
	ИначеЕсли ТипЗнч(Значение) = Тип("Соответствие") Тогда
		Возврат Новый ФиксированноеСоответствие(Значение);
	ИначеЕсли Зафиксировано(Значение) Тогда
		Возврат Значение; 
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Значение", ИмяМодуля() + ".Зафиксировать", Значение, "Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие");
	КонецЕсли;
	
КонецФункции

Функция Дефиксировать(Значение) Экспорт
	ТипЗнч = ТипЗнч(Значение);
	Если ТипЗнч = Тип("ФиксированнаяСтруктура") Тогда
		Возврат Новый Структура(Значение);
	ИначеЕсли ТипЗнч = Тип("ФиксированноеСоответствие") Тогда
		Возврат Новый Соответствие(Значение);
	ИначеЕсли ТипЗнч = Тип("Структура") Или ТипЗнч = Тип("Соответствие") Тогда
		Возврат Значение;
	Иначе
		А1Э_Служебный.ИсключениеНеверныйТип("Значение", ИмяМодуля() + ".Дефиксировать", Значение, "Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие")
	КонецЕсли;
КонецФункции

Функция СоздатьСоответствие(К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Соответствие = Новый Соответствие;
	Возврат ДобавитьКлючиИЗначения(Соответствие, К1, З1, К2, З2, К3, З3, К4, З4, К5, З5, К6, З6, К7, З7, К8, З8, К9, З9, К10, З10, К11, З11, К12, З12, К13, З13, К14, З14, К15, З15);	
КонецФункции

Функция ДобавитьКлючиИЗначения(Структура, К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Если К1 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К1, З1);
	Если К2 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К2, З2);
	Если К3 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К3, З3);
	Если К4 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К4, З4);
	Если К5 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К5, З5);
	Если К6 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К6, З6);
	Если К7 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К7, З7);
	Если К8 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К8, З8);
	Если К9 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К9, З9);
	Если К10 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К10, З10);
	Если К11 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К11, З11);
	Если К12 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К12, З12);
	Если К13 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К13, З13);
	Если К14 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К14, З14);
	Если К15 = Null Тогда Возврат Структура; КонецЕсли;
	Структура.Вставить(К15, З15);
	Возврат Структура;
КонецФункции

Функция Скопировать(Структура) Экспорт
	Если Структура = Неопределено Тогда Возврат Новый Структура; КонецЕсли;
	НоваяСтруктура = Новый Структура;
	Для Каждого Пара Из Структура Цикл
		НоваяСтруктура.Вставить(Пара.Ключ, Пара.Значение);	
	КонецЦикла;
	Возврат НоваяСтруктура;
КонецФункции

Функция СкопироватьВШаблон(Структура, К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Результат = Создать(К1, З1, К2, З2, К3, З3, К4, З4, К5, З5, К6, З6, К7, З7, К8, З8, К9, З9, К10, З10, К11, З11, К12, З12, К13, З13, К14, З14, К15, З15);
	Возврат СкопироватьСвойства(Результат, Структура);
КонецФункции

Функция СкопироватьВШаблонСЗаменой(Структура, К1 = Null, З1 = Null, К2 = Null, З2 = Null, К3 = Null, З3 = Null, К4 = Null, З4 = Null, К5 = Null, З5 = Null, К6 = Null, З6 = Null, К7 = Null, З7 = Null, К8 = Null, З8 = Null, К9 = Null, З9 = Null, К10 = Null, З10 = Null, К11 = Null, З11 = Null, К12 = Null, З12 = Null, К13 = Null, З13 = Null, К14 = Null, З14 = Null, К15 = Null, З15 = Null) Экспорт
	Результат = Создать(К1, З1, К2, З2, К3, З3, К4, З4, К5, З5, К6, З6, К7, З7, К8, З8, К9, З9, К10, З10, К11, З11, К12, З12, К13, З13, К14, З14, К15, З15);
	Возврат СкопироватьСвойства(Результат, Структура, Истина);
КонецФункции 

Функция ДобавитьКлючи(Структура, Знач Ключи) Экспорт
	Ключи = А1Э_Массивы.Массив(Ключи);
	Для Каждого Ключ Из Ключи Цикл
		Структура.Вставить(Ключ);
	КонецЦикла;
КонецФункции

Функция УдалитьКлючи(Структура, Знач Ключи) Экспорт
	Ключи = А1Э_Массивы.Массив(Ключи);
	Для Каждого Ключ Из Ключи Цикл
		Структура.Удалить(Ключ);
	КонецЦикла;
КонецФункции

Функция Класс(Структура) Экспорт
	Возврат А1Э_Классы.Класс(Структура);	
КонецФункции

Функция ВставитьЕслиОтсутствует(Структура, Ключ, Значение) Экспорт
	Если НЕ Структура.Свойство(Ключ) Тогда
		Структура.Вставить(Ключ, Значение);
	КонецЕсли;	
КонецФункции 

Функция ЯвляетсяСтруктурой(Значение) Экспорт
	Возврат ТипЗнч(Значение) = Тип("Структура") Или ТипЗнч(Значение) = Тип("ФиксированнаяСтруктура");
КонецФункции

Функция ЯвляетсяСоответствием(Значение) Экспорт
	Возврат ТипЗнч(Значение) = Тип("Соответствие") Или ТипЗнч(Значение) = Тип("ФиксированноеСоответствие");
КонецФункции 

Функция Зафиксировано(Значение) Экспорт 
	ТипЗнч = ТипЗнч(Значение);
	Возврат ТипЗнч = Тип("ФиксированнаяСтруктура") Или ТипЗнч = Тип("ФиксированноеСоответствие");
КонецФункции

#Область Устарело

Функция СкопироватьССозданием(Структура) Экспорт
	Возврат Скопировать(Структура);		
КонецФункции

#КонецОбласти

Функция ИмяМодуля() Экспорт
	Возврат "А1Э_Структуры";
КонецФункции 