Функция РезультатФункции(ПолноеИмяФункции, П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null, П10 = Null) Экспорт
	Возврат А1Э_Общее.РезультатФункции(ПолноеИмяФункции, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10);	
КонецФункции

Функция РезультатФункцииСервер(ПолноеИмяФункции, П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null, П10 = Null) Экспорт
	Возврат А1Э_ОбщееСервер.РезультатФункции(ПолноеИмяФункции, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10);	
КонецФункции 

