Функция Провести(ДокОбъект, Лог = Неопределено) Экспорт
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЛогироватьРезультат(Лог, ДокОбъект.Ссылка, "Документ " + ДокОбъект.Ссылка + " успешно проведен!");
		Возврат Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ЛогироватьРезультат(Лог, ДокОбъект.Ссылка, "Не удалось провести документ " + ДокОбъект.Ссылка + " по причине: " + ОписаниеОшибки + "! Документ записан в информационную базу.");
			Возврат Истина;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЛогироватьРезультат(Лог, ДокОбъект.Ссылка, "Не удалось записать документ " + ДокОбъект.Ссылка + " по причине: " + ОписаниеОшибки + "! Рекомендуется повторить операцию!");
			Возврат Ложь;
		КонецПопытки;
	КонецПопытки;
КонецФункции

Функция ЛогироватьРезультат(Лог, Ссылка, Сообщение)
	Если Лог = Неопределено Тогда
		Сообщить(Сообщение);
	ИначеЕсли ТипЗнч(Лог) = Тип("Массив") Тогда
		Лог.Добавить(Сообщение);
	Иначе
		А1Э_Служебный.СлужебноеИсключение("Неверный тип лога!");
	КонецЕсли;
КонецФункции 
		
