Функция МенеджерОбъектов(Знач Идентификатор) Экспорт
	Идентификатор = ВРЕГ(Идентификатор); 
	Если СтрНачинаетсяС(Идентификатор, "СПРАВОЧНИК") Тогда
		Возврат Справочники;
	ИначеЕсли СтрНачинаетсяС(Идентификатор, "ДОКУМЕНТ") Тогда
		Возврат Документы;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Осуществляет вызов процедуры или функции на сервере. Используется для того чтобы гарантировать выполнение на сервере в клиент-серверных модулях
// Не возвращает значений.
// Параметры:
//  ПолноеИмяФункции - Строка - в формате "ИмяОбщегоМодуля.ИмяФункции" или "Справочники.ИмяСправочника.ИмяФункции".
//  Параметры		 - Массив - массив параметров, в порядке соответствующем порядку параметров вызываемой функции
// 
// Возвращаемое значение:
//   - 
//
Функция СерверныйВызов(ПолноеИмяФункции, Параметры) Экспорт
	Возврат А1Э_Общее.ВыполнитьПроцедуру(ПолноеИмяФункции, Параметры);
КонецФункции

// Осуществляет вызов функции на сервере. Используется для того чтобы гарантировать выполнение на сервере в клиент-серверных модулях
// Возвращает значение в соответствии со значением возвращаемым процедурой
// Параметры:
//  ПолноеИмяФункции - Строка - в формате "ИмяОбщегоМодуля.ИмяФункции" или "Справочники.ИмяСправочника.ИмяФункции".
//  Параметры		 - Массив - массив параметров, в порядке соответствующем порядку параметров вызываемой функции
// 
// Возвращаемое значение:
//   - 
//
Функция СервернаяФункция(ПолноеИмяФункции, Параметры) Экспорт
	Возврат А1Э_Общее.ВычислитьФункцию(ПолноеИмяФункции, Параметры);
КонецФункции 

