#Область Исключения

Функция СлужебноеИсключение(Знач ТекстОшибки) Экспорт
	СтандартнаяОбработка = Истина;
	А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Э_ОбработкаСлужебногоИсключения", ТекстОшибки, СтандартнаяОбработка);
	Если СтандартнаяОбработка = Истина Тогда
		ТекстОшибки = "Программная ошибка: " + ТекстОшибки + Символы.ПС +
		"Если Вы не понимаете, что написано выше, обратитесь к администратору 1С!";
	КонецЕсли;
	ВызватьИсключение ТекстОшибки;
КонецФункции

// Вызывает исключение при несоответствии типов
//
// Параметры:
//  ИмяПеременной	 - Строка - 
//  ИмяФункции		 - Строка - 
//  Значение		 - ЛюбоеЗначение - будет приведено к строке для вывода 
//  Типы			 - Строка - можно несколько через запятую. 
// 
// Возвращаемое значение:
//   - 
//
Функция ИсключениеНеверныйТип(ИмяПеременной, ИмяФункции, Значение, Типы) Экспорт
	СлужебноеИсключение("В переменную <" + ИмяПеременной + "> было передано неверное значение " + Строка(Значение) + 
	"! Функция " + ИмяФункции + " поддерживает типы " + Типы);	
КонецФункции

Функция ИсключениеНеверныйКласс(ИмяПеременной, ИмяФункции, Значение, Классы) Экспорт
	СлужебноеИсключение("В переменную <" + ИмяПеременной + "> было передано неверное значение " + Строка(Значение) + 
	"! Функция " + ИмяФункции + " поддерживает классы " + Классы);	
КонецФункции 

#КонецОбласти 

#Область Сериализация

Функция СлужебноеПредставление(ИсточникДанных) Экспорт
	#Если НЕ ВебКлиент Тогда
		Попытка
			Запись = Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(Запись, ИсточникДанных, НазначениеТипаXML.Явное);
			Возврат Запись.Закрыть();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			Возврат ОписаниеОшибки;
		КонецПопытки;
	#Иначе
		Возврат "Служебное представление не может быть получено в веб-клиенте!";
	#КонецЕсли
КонецФункции

#КонецОбласти

Функция ЭтоАдминистраторА1() Экспорт
	ИмяПользователя = А1Э_ОбщееСервер.ИмяСистемногоПользователя();
	Если СтрНайти(ИмяПользователя, "А1_") Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь; 	
КонецФункции

#Область ОтказЗаписиПроведенияОбъектов

Функция УстановитьОтказ(Объект, Отказ, Причина = Неопределено) Экспорт 
	Отказ = Истина;
	Если НЕ А1Э_БСП.РежимОтладки() Тогда
		Если ЗначениеЗаполнено(Причина) Тогда
			Сообщить(Причина);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	ВызватьИсключение Причина;	
КонецФункции

#КонецОбласти 