#Область СозданиеНаОсновании

Функция ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Идентификатор, ИмяИлиОбъектМетаданных, Представление = Неопределено, ДополнительныеДанные = Неопределено) Экспорт
	Если ТипЗнч(ИмяИлиОбъектМетаданных) = Тип("Строка") Тогда
		РабочееИмя = ИмяИлиОбъектМетаданных;
		Если Представление = Неопределено Тогда
			А1Э_Служебный.СлужебноеИсключение("При указании имени строкой необходимо явно указывать представление");
		КонецЕсли;
		РабочееПредставление = Представление;
	Иначе
		РабочееИмя = ИмяИлиОбъектМетаданных.ПолноеИмя;
		РабочееПредставление = ИмяИлиОбъектМетаданных.Синоним;
	КонецЕсли;
	
	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	КомандаСоздатьНаОсновании.Идентификатор = Идентификатор;
	КомандаСоздатьНаОсновании.Представление = РабочееПредставление;
	КомандаСоздатьНаОсновании.Обработчик = "А1Э_БСП.СоздатьНаОсновании";
	КомандаСоздатьНаОсновании.ДополнительныеПараметры = Новый Структура("А1_ИмяСоздаваемогоОбъекта", РабочееИмя);
	КомандаСоздатьНаОсновании.МножественныйВыбор = Ложь;
	Если ДополнительныеДанные <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(КомандаСоздатьНаОсновании, ДополнительныеДанные);
	КонецЕсли;
	
КонецФункции

Функция СоздатьНаОсновании(Ссылка, ПараметрыВыполнения) Экспорт 
	#Если Сервер Или ВнешнееСоединение Тогда
		А1Э_Служебный.СлужебноеИсключение("Функция выполняется на клиенте");
	#Иначе
		ИмяСоздаваемогоОбъекта = А1Э_Структуры.ЗначениеСвойства(ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры, "А1_ИмяСоздаваемогоОбъекта");
		Если ИмяСоздаваемогоОбъекта = Неопределено Тогда
			А1Э_Служебный.СлужебноеИсключение("Не определено имя создаваемого объекта в команде создания на основании!");
		КонецЕсли;
		ОткрытьФорму(ИмяСоздаваемогоОбъекта + ".ФормаОбъекта", Новый Структура("Основание", Ссылка));  
	#КонецЕсли	
КонецФункции

#КонецОбласти

#Область ПроцедурыБСП

Функция ТекущийПользователь() Экспорт
	Попытка
		Модуль_Пользователи = Вычислить("Пользователи");
	Исключение
		А1Э_Служебный.СлужебноеИсключение("В конфигурации отсутствует модуль <Пользователи>. Возможно БСП не внедрена или внедрена неправильно!");
	КонецПопытки;
	
	Возврат Модуль_Пользователи.ТекущийПользователь();
КонецФункции 

Функция РежимОтладки() Экспорт
	//ТУДУ: сделать проверку существования БСП без режима отладки.
	//ТУДУ2: сделать свой механизм хранения данных о режиме отладки.
	Попытка
		Модуль_ОбщегоНазначенияКлиентСервер = Вычислить("ОбщегоНазначенияКлиентСервер");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Модуль_ОбщегоНазначенияКлиентСервер.РежимОтладки() = Истина;
КонецФункции

#КонецОбласти 

#Область Устарело
#Если НЕ Клиент Тогда
	
	// Перенесено в А1БСП. Оставлено для обратной совместимости.
	//
	// Параметры:
	//  ОбработкаОбъект		 - ОбработкаОбъект - 
	//  ОсновныеПараметры	 - Структура - 
	// 
	// Возвращаемое значение:
	//   - 
	//
	Функция СведенияОВнешнейОбработке(ОбработкаОбъект, ОсновныеПараметры) Экспорт
		Возврат А1БСП_ВнешниеОбработки.СведенияОВнешнейОбработке(ОбработкаОбъект, ОсновныеПараметры);
	КонецФункции
	
#КонецЕсли
#КонецОбласти 