Функция ЖСОН(Данные, ЗаписьЖСОН = Неопределено) Экспорт
	
	Если ЗаписьЖСОН = Неопределено Тогда
		ЗаписьЖСОН = Новый ЗаписьJSON;
		ЗаписьЖСОН.УстановитьСтроку();
		ВозвращатьСтроку = Истина;
	Иначе
		ВозвращатьСтроку = Ложь;
	КонецЕсли;
	
	Попытка
		ЗаписатьJSON(ЗаписьЖСОН, Данные);
		Если ВозвращатьСтроку Тогда
			Возврат ЗаписьЖСОН.Закрыть();
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат А1Э_Классы.НовыйОписаниеИсключения("", ОписаниеОшибки); 
	КонецПопытки
	
КонецФункции

Функция ЗначениеЖСОН(Строка) Экспорт
	ЧтениеЖСОН = Новый ЧтениеJSON;
	ЧтениеЖСОН.УстановитьСтроку(Строка);
	Возврат ПрочитатьJSON(ЧтениеЖСОН);
КонецФункции


