Функция ВывестиОбласть(ТабличныйДокумент, Макет, ИмяОбласти, ИсточникДанных = Неопределено) Экспорт
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Если ИсточникДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, ИсточникДанных);
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);	
КонецФункции

Функция ВывестиРазделитель(ТабличныйДокумент, ЭтоПервый = Ложь) Экспорт
	Если ЭтоПервый = Истина Тогда
		ЭтоПервый = Ложь;
	Иначе
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
КонецФункции

Функция Просмотреть(ТабличныйДокумент, Знач НомерПервойСтроки, Знач НомерПервойКолонки, Знач НомерПоследнейСтроки = Неопределено, Знач НомерПоследнейКолонки = Неопределено) Экспорт 
	Если НомерПоследнейСтроки = Неопределено Тогда
		//Считаем, что мы идем с 1 по указанные строки/колонки.
		НомерПоследнейСтроки = НомерПервойСтроки;
		НомерПоследнейКолонки = НомерПервойКолонки;
		НомерПервойСтроки = 1;
		НомерПервойКолонки = 1;
	КонецЕсли;
	Результат = Новый Массив;
	Для СчСтрок = НомерПервойСтроки По НомерПоследнейСтроки Цикл
		Строка = Новый Структура;
		Результат.Добавить(Строка);
		Строка.Вставить("НомерСтроки", СчСтрок);
		Для СчКолонок = НомерПервойКолонки По НомерПоследнейКолонки Цикл
			Строка.Вставить("Кол" + А1Э_Строки.ВСтроку(СчКолонок), ТабличныйДокумент.Область(СчСтрок, СчКолонок).Текст);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции 