
Функция GET(Запрос)
	Возврат ОбработчикЗапросаУниверсальногоАПИ(Запрос, Ложь);
КонецФункции

Функция POST(Запрос)
	Возврат ОбработчикЗапросаУниверсальногоАПИ(Запрос, Истина);
КонецФункции

Функция ОбработчикЗапросаУниверсальногоАПИ(Запрос, ИспользоватьТело = Ложь)
	Попытка	
		ИмяФункции = РаскодироватьСтроку(Запрос.ПараметрыURL["Function"], СпособКодированияСтроки.КодировкаURL);
		Параметры = МассивПараметров(Запрос, ИспользоватьТело);
		Если ИспользоватьТело = Истина Тогда
			Тело = Запрос.ПолучитьТелоКакСтроку();
			ДанныеТела = А1Э_Сериализация.РазвернутьУниверсальныйЖСОН(Тело);
			Если А1Э_СтандартныеТипы.Заполнено(ДанныеТела) Тогда
				Параметры[0] = ДанныеТела;
			КонецЕсли;
		КонецЕсли;
		РезультатФункции = А1Э_Общее.ВычислитьФункцию(ИмяФункции, Параметры);
		Возврат А1Э_Веб.Ответ(А1Э_Сериализация.СвернутьУниверсальныйЖСОН(РезультатФункции));
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить("Попытка выполнить функцию " + ИмяФункции + " с " + Параметры.Количество() + " параметрами!");
		Сч = 0;
		Для Каждого Параметр Из Параметры Цикл
			Сч = Сч + 1;
			Сообщить("Параметр " + Сч + ": " + А1Э_Сериализация.СвернутьУниверсальныйЖСОН(Параметр));
		КонецЦикла;
		Сообщить(ОписаниеОшибки);
		МассивСообщений = ПолучитьСообщенияПользователю();
		Лог = Новый Массив;
		Для Каждого Сообщение Из МассивСообщений Цикл
			Лог.Добавить(Сообщение.Текст);
		КонецЦикла;
		СтруктураОтвета = Новый Структура();
		СтруктураОтвета.Вставить("Лог", Лог);
		СтруктураОтвета.Вставить("Ошибка", Истина);
		Возврат А1Э_Веб.Ответ(А1Э_Сериализация.СвернутьУниверсальныйЖСОН(СтруктураОтвета), 400);
	КонецПопытки;

КонецФункции 

Функция МассивПараметров(Запрос, ИспользоватьТело)
	КоличествоПараметров = 10;
	
	МассивПараметров = Новый Массив(КоличествоПараметров);
	МаксПараметр = Число(ИспользоватьТело) - 1;
	Для Каждого Пара Из Запрос.ПараметрыURL Цикл
		Если НРЕГ(Пара.Ключ) = "function" Тогда
			Продолжить;
		КонецЕсли;
		Индекс = Число(Сред(Пара.Ключ, 2)) - 1;
		Если ИспользоватьТело = Истина И Индекс = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если МаксПараметр < Индекс Тогда
			МаксПараметр = Индекс;
		КонецЕсли;
	КонецЦикла;
	
	Сч = МаксПараметр;
	Пока Сч < КоличествоПараметров - 1 Цикл 
		Сч = Сч + 1;
		МассивПараметров.Удалить(МассивПараметров.Количество() - 1);
	КонецЦикла;
	
	Возврат МассивПараметров;	
КонецФункции

Функция ЗначениеПараметра(Запрос, ИмяПараметра)
	БазовоеЗначение = Запрос.ПараметрыURL.Получить(ИмяПараметра); 
	Если БазовоеЗначение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Строка = РаскодироватьСтроку(БазовоеЗначение, СпособКодированияСтроки.КодировкаURL);
	Сообщить(Строка);
	Попытка
		Возврат А1Э_Сериализация.РазвернутьУниверсальныйЖСОН(Строка);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		Сообщить("Не удалось развернуть УниверсальныйЖСОН" + Строка); 
		ВызватьИсключение "Ошибка развертки Универсального ЖСОНа!"
	КонецПопытки;
КонецФункции




