Функция ДеньМесяцГод(Знач Дата) Экспорт
	ЗначениеПодходит = Ложь;
	Если ТипЗнч(Дата) = Тип("Дата") Тогда
		ЗначениеПодходит = Истина;
	ИначеЕсли ТипЗнч(Дата) = Тип("Граница") Тогда
		Дата = Дата.Значение;
		ЗначениеПодходит = Истина;
	КонецЕсли;
	
	Возврат ?(ЗначениеПодходит, Формат(Дата, "ДФ=""дд.ММ.гггг"""), Неопределено);
КонецФункции

Функция ВремяДня(Дата) Экспорт
	Возврат Дата - НачалоДня(Дата);	
КонецФункции

Функция ОписаниеТипа() Экспорт
	Возврат Новый ОписаниеТипов("Дата");	
КонецФункции 