Функция ДанныеТипаМетаданных(ОбъектМетаданных) Экспорт 
	Возврат ДанныеТиповМетаданных()[А1Э_Метаданные.ТипМетаданных(ОбъектМетаданных)];
КонецФункции

Функция ДанныеТиповМетаданных()
	ДанныеТипов = Новый Структура;
	ДанныеТипов.Вставить("Справочник", НовыйДанныеТипа("Catalog", "Catalogs"));
	ДанныеТипов.Вставить("Документ", НовыйДанныеТипа("Document", "Documents"));
	ДанныеТипов.Вставить("ОбщийМакет", НовыйДанныеТипа("CommonTemplate", "CommonTemplates"));
	Возврат ДанныеТипов;
КонецФункции

Функция НовыйДанныеТипа(Имя, Каталог)
	Возврат А1Э_Структуры.Создать(
	"Имя", Имя,
	"Каталог", Каталог,
	);
КонецФункции

Функция ПутьКОписаниюОбъектаМетаданных(Каталог, ОбъектМетаданных) Экспорт
	Возврат А1Э_Файлы.СложитьПути(Каталог, ДанныеТипаМетаданных(ОбъектМетаданных).Каталог, ОбъектМетаданных.Имя + ".xml"); 
КонецФункции                                                                                        