#Область ГлобальныеПерехваты

Функция ПриНачалеРаботыСистемы() Экспорт
	Контекст = Новый Структура;
	А1Э_ПроверкиСистемы.ПроверитьРаботоспособностьСистемы(Контекст);
	ПоздравитьПользователяСПраздником();
КонецФункции 

#КонецОбласти 

#Область ПоздравитьПользователяСПраздником

Функция ПоздравитьПользователяСПраздником() 
	//ОткрытьФорму("ОбщаяФорма.А1Э_ПоздравлениеПользователей");	
КонецФункции

#КонецОбласти

Функция ВыполнитьСкрипт(ТекстСкрипта, РабочийКаталог = Неопределено) Экспорт
	Shell = Новый ComОбъект("WScript.Shell"); 
	Если РабочийКаталог <> Неопределено Тогда
		Shell.CurrentDirectory = РабочийКаталог;
	КонецЕсли;
	Shell.Run(ТекстСкрипта, 0, 1);
КонецФункции 

