Функция НайтиДубли(ИмяМетаданных, Знач СовпадающиеРеквизиты, Знач Параметры = Неопределено) Экспорт
	СовпадающиеРеквизиты = А1Э_Массивы.Массив(СовпадающиеРеквизиты);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.А1Э_Реквизиты КАК А1Э_Реквизиты,
	|	ТаблицаДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.А1Э_Реквизиты КАК А1Э_Реквизиты,
	|		КОЛИЧЕСТВО(Таблица.Ссылка) КАК КоличествоСсылок
	|	ИЗ
	|		ИмяМетаданных КАК Таблица
	|	ГДЕ
	|		&Отборы
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Таблица.А1Э_Реквизиты
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(Таблица.Ссылка) > 1) КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИмяМетаданных КАК ТаблицаДокумента
	|		ПО (&УсловияСоединения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.А1Э_Реквизиты";
	РеквизитыЗапроса = Новый Массив;
	ГруппировкиЗапроса = Новый Массив;
	УсловияСоединения = Новый Массив;
	Для Каждого Реквизит Из СовпадающиеРеквизиты Цикл
		РеквизитыЗапроса.Добавить("Таблица." + Реквизит + " КАК " + Реквизит);
		ГруппировкиЗапроса.Добавить("Таблица." + Реквизит);
		УсловияСоединения.Добавить("Таблица." + Реквизит + " = ТаблицаДокумента." + Реквизит);
	КонецЦикла;
	А1Э_Строки.Подставить(Запрос.Текст, "ИмяМетаданных", ИмяМетаданных);
	А1Э_Строки.Подставить(Запрос.Текст, "Таблица.А1Э_Реквизиты КАК А1Э_Реквизиты", СтрСоединить(РеквизитыЗапроса, "," + Символы.ПС + Символы.Таб));
	А1Э_Строки.Подставить(Запрос.Текст, "Таблица.А1Э_Реквизиты", СтрСоединить(ГруппировкиЗапроса, "," + Символы.ПС + Символы.Таб));
	А1Э_Строки.Подставить(Запрос.Текст, "&УсловияСоединения", СтрСоединить(УсловияСоединения, Символы.ПС + Символы.Таб + "И ")); 
	
	ОбъектМетаданных = А1Э_Метаданные.ОбъектМетаданных(ИмяМетаданных);
	Отборы = Новый Массив;
	Сч = 0;
	Если НЕ А1Э_Структуры.ЗначениеСвойства(Параметры, "СчитатьПустыеДублями", Ложь) Тогда
		Для Каждого Реквизит Из СовпадающиеРеквизиты Цикл
			ПустоеЗначение = А1Э_СтандартныеТипы.ПустоеЗначение(А1Э_Метаданные.ОписаниеТипаПоля(ИмяМетаданных, Реквизит));
			Отборы.Добавить("Таблица." + Реквизит + " <> &Параметр" + Сч);
			Запрос.УстановитьПараметр("Параметр" + Сч, ПустоеЗначение);
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	А1Э_Строки.Подставить(Запрос.Текст, "&Отборы", ?(Отборы.Количество() = 0, "ИСТИНА", СтрСоединить(Отборы, Символы.ПС + Символы.Таб + "И ")));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 