Функция Создать(Элемент1 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент2 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент3 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент4 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент5 = "НЕ_БУДЕТ_ДОБАВЛЕНО",
	Элемент6 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент7 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент8 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент9 = "НЕ_БУДЕТ_ДОБАВЛЕНО", Элемент10 = "НЕ_БУДЕТ_ДОБАВЛЕНО") Экспорт
	
	Массив = Новый Массив;
	
	Если Элемент1 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент1);
	КонецЕсли;
	Если Элемент2 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент2);
	КонецЕсли;
	Если Элемент3 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент3);
	КонецЕсли;
	Если Элемент4 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент4);
	КонецЕсли;
	Если Элемент5 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент5);
	КонецЕсли;
	Если Элемент6 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент6);
	КонецЕсли;
	Если Элемент7 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент7);
	КонецЕсли;
	Если Элемент8 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент8);
	КонецЕсли;
	Если Элемент9 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент9);
	КонецЕсли;
	Если Элемент10 = "НЕ_БУДЕТ_ДОБАВЛЕНО" Тогда
		Возврат Массив;
	Иначе
		Массив.Добавить(Элемент10);
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Функция ИзСтроки(Строка, ТипЗначения) Экспорт 
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка,",");
	Массив = Новый Массив;
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если ТипЗначения = Тип("Число") Тогда
			Массив.Добавить(Число(СтрокаМассива));
		Иначе
			ВызватьИсключение "Тип " + ТипЗначения + " не поддерживается функцией А1Э_Массивы.ИзСтроки!";
		КонецЕсли;
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция Массив(Данные) Экспорт
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Возврат Данные;
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат А1Э_Строки.Разделить(Данные, ",");
	ИначеЕсли Данные = Неопределено Тогда
		Возврат Новый Массив;
	Иначе
		Возврат Создать(Данные);
	КонецЕсли;
КонецФункции

Функция ЕдинственныйЭлемент(Массив) Экспорт
	#Если Сервер И НЕ Сервер Тогда
		Массив = Новый Массив;		
	#КонецЕсли
	
	Если Массив.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Массив.Количество() > 1 Тогда
		А1Э_Служебный.СлужебноеИсключение("В массиве более одного элемента!");
	Иначе
		Возврат Массив[0];
	КонецЕсли;
	
КонецФункции 

Функция Сортировать(Массив, Знач Направление = "Возр") Экспорт
	Направление = А1Э_СтандартныеТипы.НаправлениеСортировкиПолучить(Направление);
	
	Список = Новый СписокЗначений;
    Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоЗначению(Направление);    
	Массив = Список.ВыгрузитьЗначения();
КонецФункции

Функция Скопировать(Массив) Экспорт
	НовыйМассив = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		НовыйМассив.Добавить(Элемент);
	КонецЦикла;
	Возврат НовыйМассив;	
КонецФункции

Функция Получить(Массив, Индекс) Экспорт
	Если Индекс < Массив.Количество() Тогда
		Возврат Массив[Индекс];
	КонецЕсли;
	Возврат Неопределено;
КонецФункции 

Функция Добавить(Массив, Источник) Экспорт
	МассивДобавления = Массив(Источник);	
	Для Каждого Элемент Из МассивДобавления Цикл
		Массив.Добавить(Элемент);
	КонецЦикла;
КонецФункции

Функция Последний(Массив) Экспорт
	Если Массив.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Массив[Массив.Количество() - 1];	
КонецФункции

Функция ЭлементСКонца(Массив, Индекс = 0) Экспорт
	Если Массив.Количество() <= Индекс Тогда
		А1Э_Служебный.СлужебноеИсключение("Количество элементов в массиве меньше индекса!");
	КонецЕсли;
	Возврат Массив[Массив.Количество() - 1 - Индекс];
КонецФункции

Функция Свернуть(Массив) Экспорт
	СвернутыйМассив = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат СвернутыйМассив;
КонецФункции 