Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	//Механизмы форм
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ВводНаОсновании", "А1Э_МеханизмыФорм", "ВводНаОсновании__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ОповещениеОЗаписи", "А1Э_МеханизмыФорм", "ОповещениеОЗаписи__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_Переходы", "А1Э_МеханизмыФорм", "Переходы__"));
	
	//Механизмы объектов
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_СохранениеИдентификаторов", "А1Э_МеханизмыОбъектов", "СохранениеИдентификаторов__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ПроверкаНового", "А1Э_МеханизмыОбъектов", "ПроверкаНового__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_КонтрольИзменений", "А1Э_МеханизмыОбъектов", "КонтрольИзменений__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ПроверкаУникальностиРеквизитов", "А1Э_МеханизмыОбъектов", "ПроверкаУникальностиРеквизитов__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_СписокИзменений", "А1Э_МеханизмыОбъектов", "СписокИзменений__"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ЗаполнениеПоУмолчанию", "А1Э_МеханизмыОбъектов", "ЗаполнениеПоУмолчанию__"));
	
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ОбновлениеРасширений"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1Э_ИзменениеОбъектов"));
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.ДобавитьКОбъектам(СписокОбъектов, А1Э_Механизмы.Адресация__ВсеОбъекты(), "А1Э_ПроверкаНового");
	А1Э_Механизмы.ДобавитьКОбъектам(СписокОбъектов, А1Э_Механизмы.Адресация__ВсеОбъекты(), "А1Э_СохранениеИдентификаторов");
КонецФункции
