Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	//Механизмы форм
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ВводНаОсновании", "А1Э_МеханизмыФорм", "ВводНаОсновании__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ОповещениеОЗаписи", "А1Э_МеханизмыФорм", "ОповещениеОЗаписи__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_Переходы", "А1Э_МеханизмыФорм", "Переходы__");
	
	//Механизмы объектов
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_СохранениеИдентификаторов", "А1Э_МеханизмыОбъектов", "СохранениеИдентификаторов__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ПроверкаНового", "А1Э_МеханизмыОбъектов", "ПроверкаНового__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_КонтрольИзменений", "А1Э_МеханизмыОбъектов", "КонтрольИзменений__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ПроверкаУникальностиРеквизитов", "А1Э_МеханизмыОбъектов", "ПроверкаУникальностиРеквизитов__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_СписокИзменений", "А1Э_МеханизмыОбъектов", "СписокИзменений__");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ЗаполнениеПоУмолчанию", "А1Э_МеханизмыОбъектов", "ЗаполнениеПоУмолчанию__");
	
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ОбновлениеРасширений");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_ИзменениеОбъектов");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Э_УниверсальнаяФорма");
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__ВсеОбъекты(), "А1Э_ПроверкаНового");
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__ВсеОбъекты(), "А1Э_СохранениеИдентификаторов");
	А1Э_Механизмы.Подключить(СписокОбъектов, "ОбщаяФорма.А1Э_УниверсальнаяФорма", "А1Э_УниверсальнаяФорма"); 
КонецФункции
