Функция ВыгрузитьКонфигурациюВФайлы()
	//Создать	
КонецФункции

#Область ГенерацияРасширений
#Если НЕ Клиент Тогда
	
	Функция СоздатьРасширениеМеханизмов(ПараметрыРасширения = "А1М", Знач Объекты = Неопределено) Экспорт
		Объекты = А1Э_Массивы.Массив(Объекты);
		ОбъектыМетаданных = Новый Массив;
		Для Каждого Объект Из Объекты Цикл
			ОбъектыМетаданных.Добавить(А1Э_Метаданные.ОбъектМетаданных(Объект));
		КонецЦикла;
		Если ОбъектыМетаданных.Количество() = 0 Тогда
			Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
				ОбъектыМетаданных.Добавить(ОбъектМетаданных);
			КонецЦикла;
			Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
				ОбъектыМетаданных.Добавить(ОбъектМетаданных);
			КонецЦикла;
		КонецЕсли;
		
		ЕстьСправочники = Ложь; ЕстьДокументы = Ложь;
		Для Каждого ОбъектМетаданных Из ОбъектыМетаданных Цикл
			ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
			Если СтрНачинаетсяС(ПолноеИмя, "Справочник") Тогда
				ЕстьСправочники = Истина;
			КонецЕсли;
			Если СтрНачинаетсяС(ПолноеИмя, "Документ") Тогда
				ЕстьДокументы = Истина;
			КонецЕсли;
		КонецЦикла;
		
		КаталогСоздания = КаталогВременныхФайлов() + "\A1MechanismExtension";
		Если А1Э_Файлы.ФайлСуществует(КаталогСоздания) Тогда
			УдалитьФайлы(КаталогСоздания);
		КонецЕсли;
	
		СоздатьКаталог(КаталогСоздания);
		Если ЕстьСправочники Тогда
			СоздатьКаталог(КаталогСоздания + "\Catalogs");
		КонецЕсли;
		Если ЕстьДокументы Тогда
			СоздатьКаталог(КаталогСоздания + "\Documents");
		КонецЕсли;
		
		КорневойДокумент = Новый ДокументDOM("", "#document");
		
	КонецФункции
	
	Функция СоздатьКорневойДокумент(ИмяРасширения, ОбъектыМетаданных)
		
		//ДОМ = Новый ДокументDOM("", "#document");
		//МетаданныеДОМ = ДОМ.СоздатьЭлемент("MetaDataObject");
		//ЗаполнитьАтрибутыЭлементаМетаданных(МетаданныеДОМ);
		//КонфигурацияДОМ = ДОМ.СоздатьЭлемент("Configuration");
		//МетаданныеДОМ.ДобавитьДочерний(КонфигурацияДОМ);
		//КонфигурацияДОМ.УстановитьАтрибут("uuid", Строка(Новый УникальныйИдентификатор));
	КонецФункции
	
	Функция ЗаполнитьАтрибутыЭлементаМетаданных(МетаданныеДОМ)
		МетаданныеДОМ.УстановитьАтрибут("xmlns", "http://v8.1c.ru/8.3/MDClasses");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:app", "http://v8.1c.ru/8.2/managed-application/core");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:cfg", "http://v8.1c.ru/8.1/data/enterprise/current-config");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:cmi", "http://v8.1c.ru/8.2/managed-application/cmi");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:ent", "http://v8.1c.ru/8.1/data/enterprise");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:lf", "http://v8.1c.ru/8.2/managed-application/logform");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:style", "http://v8.1c.ru/8.1/data/ui/style");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:sys", "http://v8.1c.ru/8.1/data/ui/fonts/system");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:v8", "http://v8.1c.ru/8.1/data/core");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:v8ui", "http://v8.1c.ru/8.1/data/ui");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:web", "http://v8.1c.ru/8.1/data/ui/colors/web");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:win", "http://v8.1c.ru/8.1/data/ui/colors/windows");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:xen", "http://v8.1c.ru/8.3/xcf/enums");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:xpr", "http://v8.1c.ru/8.3/xcf/predef");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:xr", "http://v8.1c.ru/8.3/xcf/readable");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:xs", "http://www.w3.org/2001/XMLSchema");
		МетаданныеДОМ.УстановитьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		МетаданныеДОМ.УстановитьАтрибут("version", "2.10");
	КонецФункции
	
#КонецЕсли
 
#КонецОбласти 

Функция ИмяМодуля() Экспорт
	Возврат	"А1Э_Конфигуратор";
КонецФункции 