#Если НЕ Клиент Тогда
	
	Функция ПроверитьИСоздать(Префикс) Экспорт
		ИмяСправочника = Префикс + "_НастройкиСистемы";
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки.Ссылка КАК Ссылка
		|ИЗ
		|	Таблица КАК Настройки
		|ГДЕ
		|	Настройки.Наименование = ""Глобальные настройки""";
		А1Э_Строки.Подставить(Запрос.Текст, "Таблица", "Справочник." + ИмяСправочника);
		ГлобальныеНастройки = А1Э_Запросы.ПервыйРезультат(Запрос);
		Если ГлобальныеНастройки <> Неопределено Тогда Возврат ГлобальныеНастройки КонецЕсли;
		
		ГлобальныеНастройки = Справочники[ИмяСправочника].СоздатьЭлемент();
		ГлобальныеНастройки.Наименование = "Глобальные настройки";
		ГлобальныеНастройки.Записать();
		
		Возврат ГлобальныеНастройки.Ссылка;		
	КонецФункции 
	
#КонецЕсли

Функция Значение(Префикс, Имя, ПовтИсп = Истина) Экспорт
	Если ПовтИсп Тогда Возврат А1Э_ПовторноеИспользование.РезультатФункцииСервер(ИмяМодуля() + ".Значение", Префикс, Имя, Ложь); КонецЕсли;
		
	#Если Клиент Тогда
		ВызватьИсключение "Значение настройки системы на клиенте может быть получено только в режиме повторного использования!";
	#Иначе
		УстановитьПривилегированныйРежим(Истина);
		Возврат ВсеЗначения(Префикс)[Имя];
	#КонецЕсли
КонецФункции

Функция ВсеЗначения(Префикс, ПовтИсп = Истина) Экспорт
	Если ПовтИсп Тогда Возврат А1Э_ПовторноеИспользование.РезультатФункцииСервер(ИмяМодуля() + ".ВсеЗначения", Префикс, Ложь); КонецЕсли;
	
	#Если Клиент Тогда
		ВызватьИсключение "Значение настроек системы на клиенте может быть получено только в режиме повторного использования!";
	#Иначе
		УстановитьПривилегированныйРежим(Истина);
		Возврат ПроверитьИСоздать(Префикс);
	#КонецЕсли
КонецФункции

Функция ИмяМодуля() Экспорт
	Возврат "А1Э_НастройкиСистемы"; 
КонецФункции 