#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	А1Э_Формы.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	А1Э_Формы.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	А1Э_Формы.ПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтроки(Элемент)
	А1Э_Формы.ПриАктивизацииСтроки(ЭтаФорма, Элемент);	
КонецПроцедуры

#КонецОбласти

#Область БСП

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    А1Э_БСП.Подключаемый_ВыполнитьКоманду(ЭтаФорма, Команда);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    А1Э_БСП.Подключаемый_ВыполнитьКомандуНаСервере(ЭтаФорма, Контекст, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    А1Э_БСП.Подключаемый_ОбновитьКоманды(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 
