Функция ДобавитьКомандуПечати(КомандыПечати, МенеджерПечати, Идентификатор, Наименование = "", ДополнительныеПараметры = Неопределено) Экспорт 
	Строка = КомандыПечати.Добавить();
	Строка.МенеджерПечати = МенеджерПечати;
	Строка.Идентификатор = Идентификатор;
	Если Наименование <> "" Тогда
		Строка.Представление = Наименование;
	Иначе
		Строка.Представление = А1Э_Строки.Наименование(Идентификатор);
	КонецЕсли;
	ПрочиеПараметры = НовыйПараметрыКомандПечати();
	Если ДополнительныеПараметры <> Неопределено Тогда
		А1Э_Структуры.СкопироватьСвойства(ПрочиеПараметры, ДополнительныеПараметры, Истина);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Строка, ПрочиеПараметры);
КонецФункции

Функция НовыйПараметрыКомандПечати() 
	Возврат А1Э_Структуры.Создать("ПроверкаПроведенияПередПечатью", Истина);	
КонецФункции 