Функция ДобавитьКомандуПечати(КомандыПечати, МенеджерПечати, Идентификатор, Наименование = "", ДополнительныеПараметры = Неопределено) Экспорт 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	УстановитьСтандартныеСвойстваКомандыПечати(КомандаПечати, Идентификатор, Наименование, ДополнительныеПараметры);
КонецФункции

Функция ДобавитьКомандуПечатиПоОбработчику(КомандыПечати, Обработчик, Идентификатор, Наименование = "", ДополнительныеПараметры = Неопределено) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = Обработчик;
	УстановитьСтандартныеСвойстваКомандыПечати(КомандаПечати, Идентификатор, Наименование, ДополнительныеПараметры);	
КонецФункции

#Область Служебно

Функция УстановитьСтандартныеСвойстваКомандыПечати(КомандаПечати, Идентификатор, Наименование = "", ДополнительныеПараметры = Неопределено)
	КомандаПечати.Идентификатор = Идентификатор;
	Если Наименование <> "" Тогда
		КомандаПечати.Представление = Наименование;
	Иначе
		КомандаПечати.Представление = А1Э_Строки.Наименование(Идентификатор);
	КонецЕсли;
	ПрочиеПараметры = НовыйПараметрыКомандПечати();
	Если ДополнительныеПараметры <> Неопределено Тогда
		А1Э_Структуры.СкопироватьСвойства(ПрочиеПараметры, ДополнительныеПараметры, Истина);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(КомандаПечати, ПрочиеПараметры);	
КонецФункции

Функция НовыйПараметрыКомандПечати() 
	Возврат А1Э_Структуры.Создать("ПроверкаПроведенияПередПечатью", Истина);	
КонецФункции

#КонецОбласти 

#Область СтандартныеДанныеПечати

Функция ДобавитьРеквизитыДоговора(Префикс, ИсточникДанных, ПриемникДанных) Экспорт 
	Префикс_ = Префикс + "_";
	ПриемникДанных.Вставить(Префикс_ + "ЮрНаименование", ИсточникДанных[Префикс_ + "ЮрНаименование"]);
	ПриемникДанных.Вставить(Префикс_ + "ЮрНаименованиеСокр", ИсточникДанных[Префикс_ + "ЮрНаименованиеСокр"]);
	ПриемникДанных.Вставить(Префикс_ + "Должность", ИсточникДанных[Префикс_ + "Должность"]);
	ПриемникДанных.Вставить(Префикс_ + "ДолжностьРодП", А1Э_Строки.Склонение(ИсточникДанных[Префикс_ + "Должность"], "Р", ,"Д"));
	ПриемникДанных.Вставить(Префикс_ + "ФИОРодП", А1Э_Строки.Склонение(ИсточникДанных[Префикс_ + "ФИО"], "Р"));
	ПриемникДанных.Вставить(Префикс_ + "ОснованиеРодП", ?(ЗначениеЗаполнено(ИсточникДанных[Префикс_ + "Основание"]), А1Э_Строки.Склонение(ИсточникДанных[Префикс_ + "Основание"], , , "В"), "Устава"));
	ПриемникДанных.Вставить(Префикс_ + "ФИОСокр", А1Э_Строки.ФИО(ИсточникДанных[Префикс_ + "ФИО"]));
КонецФункции

#КонецОбласти 