#Область Перехваты
	
	Функция УстановкаПараметровСеансаПосле(ТребуемыеПараметры) Экспорт
		Контекст = Новый Структура;
		Если ТребуемыеПараметры = Неопределено Тогда
			А1Э_ОграниченияДоступа.ЗаполнитьПараметрыСеанса(Контекст);
		КонецЕсли;
		Если НеобходимоУстановить(ТребуемыеПараметры, "А1Э_ГруппыТекущегоПользователя") Тогда
			А1Э_Пользователи.ЗаполнитьПараметрСеансаГруппыТекущегоПользователя();
		КонецЕсли;
		Если НеобходимоУстановить(ТребуемыеПараметры, "А1Э_СвязиСсылокИСистемныхКодов") Тогда
			А1Э_Метаданные.УстановитьСвязьСсылокИСистемныхКодов();
		КонецЕсли;
		Если НеобходимоУстановить(ТребуемыеПараметры, "А1Э_ПараметрыМеханизмов") Тогда
			А1Э_Механизмы.УстановитьПараметрСеанса();
		КонецЕсли;
	КонецФункции
	
#КонецОбласти 

Функция НеобходимоУстановить(ТребуемыеПараметры, Идентификатор) Экспорт
	Если ТребуемыеПараметры = Неопределено Тогда Возврат Ложь; КонецЕсли; 
	
	Возврат ТребуемыеПараметры.Найти(Идентификатор) <> Неопределено;
КонецФункции

Функция МожноУстановить(ТребуемыеПараметры, Идентификатор) Экспорт
	Если А1Э_ОбщееСервер.ЭтоФоновоеЗадание() Тогда Возврат Ложь; КонецЕсли;
	Если ТребуемыеПараметры = Неопределено Тогда
		//В фоновых заданиях критические параметры сеанса устанавливаются только при непосредственной необходимости.
		//В прочих случаях они устанавливаются при начале работы системы.
		Возврат НЕ А1Э_ОбщееСервер.ЭтоФоновоеЗадание(); 
	КонецЕсли;
	
	Возврат ТребуемыеПараметры.Найти(Идентификатор) <> Неопределено;
КонецФункции 