Функция СтруктураНТМЛ(ФорматированныйДокумент) Экспорт
	Структура = Новый Структура("НТМЛ, Картинки");
	ФорматированныйДокумент.ПолучитьHTML(Структура.НТМЛ, Структура.Картинки);
	Возврат Структура;
КонецФункции

Функция УстановитьНТМЛ(ФорматированныйДокумент, СтруктураНТМЛ) Экспорт
	Если СтруктураНТМЛ = Неопределено Тогда
		ФорматированныйДокумент.Удалить();
	Иначе
		ФорматированныйДокумент.УстановитьHTML(СтруктураНТМЛ.НТМЛ, СтруктураНТМЛ.Картинки);
	КонецЕсли;
КонецФункции 

Функция СсылкаНаИсточник(Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(А1Э_Общее.ЗначениеСвойства(Форма.Параметры, "ЗначениеКопирования")) Тогда
		Возврат Форма.Объект.Ссылка;
	Иначе
		Возврат Форма.Параметры.ЗначениеКопирования;
	КонецЕсли;	
КонецФункции 