// Преобразует ФорматированныйДокумент в структуру, из которой его можно обратно собрать.
// Структура содержит ключи "НТМЛ" (HTML-содержимое в виде Строки) и "Картинки" (структура, ключи это имена картинок, значения - сами Картинки)
// Параметры:
//  ФорматированныйДокумент	 - ФорматированныйДокумент - 
// 
// Возвращаемое значение:
//   - Структура
//
Функция СтруктураНТМЛ(ФорматированныйДокумент) Экспорт
	Структура = Новый Структура("НТМЛ, Картинки");
	ФорматированныйДокумент.ПолучитьHTML(Структура.НТМЛ, Структура.Картинки);
	Возврат Структура;
КонецФункции

// Восстанавливает ФорматированныйДокумент согласно переданной структуре.
//
// Параметры:
//  ФорматированныйДокумент	 - ФорматированныйДокумент	 - 
//  СтруктураНТМЛ			 - Структура - см. функцию СтруктураНТМЛ()
// 
// Возвращаемое значение:
//   - 
//
Функция УстановитьНТМЛ(ФорматированныйДокумент, СтруктураНТМЛ) Экспорт
	Если СтруктураНТМЛ = Неопределено Тогда
		ФорматированныйДокумент.Удалить();
	Иначе
		ФорматированныйДокумент.УстановитьHTML(СтруктураНТМЛ.НТМЛ, СтруктураНТМЛ.Картинки);
	КонецЕсли;
КонецФункции 

Функция СсылкаНаИсточник(Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(А1Э_Общее.ЗначениеСвойства(Форма.Параметры, "ЗначениеКопирования")) Тогда
		Возврат Форма.Объект.Ссылка;
	Иначе
		Возврат Форма.Параметры.ЗначениеКопирования;
	КонецЕсли;	
КонецФункции 